# CSV(Comma Seperated Values)

In [1]:
#using the csv module
import csv

with open(file="try.csv", mode="r") as f:
    reader = csv.reader(f)
    for row in reader:
        print(row)

['Name', 'Address', 'Age']
['Ram', 'Biratnagar', '22']
['Shyam', 'Itahari', '23']
['Hari', 'Dharan', '21']

In [13]:
#using the dictionary writer
import csv

with open(file="try.csv", mode="r") as f:
    reader = csv.DictReader(f)
    for row in reader:
        print(row)

{'Name': 'Ram', 'Address': 'Biratnagar', 'Age': '22'}
{'Name': 'Shyam', 'Address': 'Itahari', 'Age': '23'}
{'Name': 'Hari', 'Address': 'Dharan', 'Age': '21'}

In [ ]:

# writing using writer
data = [
    ['Name', 'Address', 'Age'],
    ['Ram', 'Biratnagar', 22],
    ['Shyam', 'Itahari', 23],
    ['Hari', 'Dharan', 21]
]

with open(file="newnew.csv", mode="w", newline="") as f:
    writer = csv.writer(f)
    writer.writerows(data)

In [21]:
import csv
data = [
    {'Name': 'Ram', 'Address': 'Biratnagar', 'Age': 22},
    {'Name': 'Shyam', 'Address': 'Itahari', 'Age': 23},
    {'Name': 'Hari', 'Address': 'Dharan', 'Age': 21},
]

with open(file="newnewnew.csv", mode="w", newline=""):
    dictionaryWriter = csv.DictWriter(f, fieldnames=["Name", "Address", "Age"])
    dictionaryWriter.writeheader()
    dictionaryWriter.writerows(data)

ValueError: I/O operation on closed file.

In [34]:
import pandas as pd

df = pd.read_csv("newnewnew.csv")

print(df)
print(type(df))

    Name     Address  Age
0    Ram  Biratnagar   22
1  Shyam         NaN   23
2   Hari      Dharan   21
<class 'pandas.core.frame.DataFrame'>

In [35]:
df['Name']

0      Ram
1    Shyam
2     Hari
Name: Name, dtype: object

In [36]:
# display information of dataframe

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Address  2 non-null      object
 2   Age      3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [37]:
# view the data from head
df.head()

    Name     Address  Age
0    Ram  Biratnagar   22
1  Shyam         NaN   23
2   Hari      Dharan   21

In [38]:
# view the random sample
df.sample()

  Name     Address  Age
0  Ram  Biratnagar   22

In [39]:
df.isnull().sum()

Name       0
Address    1
Age        0
dtype: int64

In [40]:
df["Province"] = "Koshi"

In [41]:
df.head()

    Name     Address  Age Province
0    Ram  Biratnagar   22    Koshi
1  Shyam         NaN   23    Koshi
2   Hari      Dharan   21    Koshi

In [46]:
df.to_csv("neww.csv", index=False)

In [47]:
df.head()

    Name     Address  Age Province
0    Ram  Biratnagar   22    Koshi
1  Shyam         NaN   23    Koshi
2   Hari      Dharan   21    Koshi

In [50]:
dataframe = pd.DataFrame([
    {"Roll": 1, "Name": "Ram", "Eng": 80, "Math": 81, "Science": 82},
    {"Roll": 2, "Name": "Shyam", "Eng": 79, "Math": 80, "Science": 83}
])

In [51]:
dataframe

   Roll   Name  Eng  Math  Science
0     1    Ram   80    81       82
1     2  Shyam   79    80       83

In [70]:
dataframe["Total"] = dataframe["Eng"] + dataframe["Math"] + dataframe['Science']
dataframe['Percentage'] = (dataframe['Total'] / 3).round(decimals=3)

In [71]:
dataframe

   Roll   Name  Eng  Math  Science  Total  Percentage
0     1    Ram   80    81       82    243      81.000
1     2  Shyam   79    80       83    242      80.667

In [72]:
dataframe.to_csv("Result.csv", index=False)

  name  age  skills
0  Bob   30  Python
1  Bob   30      ML

In [80]:
import json
import pprint


with open(file="data.json", mode="r") as f:
    data = json.load(f)

pprint.pprint(data)

{'age': 30, 'name': 'Bob', 'skills': ['Python', 'ML']}

In [ ]:
data = {'age': 30, 'name': 'Bob', 'skills': ['Python', 'ML'], 'thar': 'Oli'}

with open("data2.json", "w") as f:
    json.dump(data, f, indent=4)

## Task: Excel file manipulation